Tekla Open API Reference for Tekla Structures 2025
Point.Z Field
 The Z-coordinate of the point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Z
Public Z As Double
Field Value
Type: Double
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace